The plan is saved for 4f0ac738cf11b4bc5b17b983e017ab7216f6e5bc.
Use `/apply` to apply the plan and merge this PR.
<details><summary>Show output</summary>

```
warning: file 'nixpkgs' was not found in the Nix search path (add it using $NIX_PATH or -I), at (string):1:9; will use bash from your environment
module.staging.module.minio.random_password.secret_key: Refreshing state... [id=none]
module.staging.module.minio.random_password.access_key: Refreshing state... [id=none]
module.staging.module.database.random_password.password: Refreshing state... [id=none]
module.staging.module.database.random_password.username: Refreshing state... [id=none]
module.staging.module.minio.sakuracloud_packet_filter.switch: Refreshing state... [id=113300784459]
module.staging.module.database.sakuracloud_disk.data_disk: Refreshing state... [id=113300784609]
module.staging.module.beta.sakuracloud_packet_filter.external: Refreshing state... [id=113300784454]
module.staging.module.minio.sakuracloud_disk.data_disk: Refreshing state... [id=113300784608]
module.staging.sakuracloud_switch.internal: Refreshing state... [id=113300784458]
module.staging.module.database.sakuracloud_packet_filter.switch: Refreshing state... [id=113300784456]
module.staging.module.nightly.sakuracloud_packet_filter.external: Refreshing state... [id=113300784461]
sakuracloud_internet.router: Refreshing state... [id=113300784612]
module.staging.module.nightly.module.nixos_archive.sakuracloud_archive.nixos: Refreshing state... [id=113300784619]
module.staging.module.nightly.sakuracloud_disk.server_disk: Refreshing state... [id=113300784620]
module.staging.module.nightly.sakuracloud_server.server: Refreshing state... [id=113300784623]
module.staging.module.beta.module.nixos_archive.sakuracloud_archive.nixos: Refreshing state... [id=113300784621]
module.staging.module.beta.sakuracloud_disk.server_disk: Refreshing state... [id=113300784632]
module.staging.module.beta.sakuracloud_server.server: Refreshing state... [id=113300784638]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.staging.module.beta.sakuracloud_disk.server_disk must be replaced
-/+ resource "sakuracloud_disk" "server_disk" {
      ~ id                = "113300784632" -> (known after apply)
        name              = "sos21_staging_server_disk"
      ~ server_id         = "113300784638" -> (known after apply)
      ~ source_archive_id = "113300784621" -> (known after apply) # forces replacement
        tags              = [
            "sos21_beta",
            "sos21_server_disk",
            "sos21_staging",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.staging.module.beta.sakuracloud_server.server will be updated in-place
  ~ resource "sakuracloud_server" "server" {
      ~ disks            = [
          - "113300784632",
        ] -> (known after apply)
        id               = "113300784638"
        name             = "sos21_staging_server"
        tags             = [
            "sos21_beta",
            "sos21_server",
            "sos21_staging",
        ]
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.staging.module.database.sakuracloud_disk.disk will be created
  + resource "sakuracloud_disk" "disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "sos21_database_disk"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = (known after apply)
      + tags              = [
          + "sos21_database",
          + "sos21_database_disk",
          + "sos21_staging",
        ]
      + zone              = "is1a"
    }

  # module.staging.module.database.sakuracloud_server.database will be created
  + resource "sakuracloud_server" "database" {
      + commitment        = "standard"
      + core              = 1
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 1
      + name              = "sos21_database"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "sos21_database",
          + "sos21_database_server",
          + "sos21_staging",
        ]
      + zone              = "is1a"

      + network_interface {
          + mac_address      = (known after apply)
          + packet_filter_id = "113300784456"
          + upstream         = "113300784458"
          + user_ip_address  = "192.168.0.11"
        }
    }

  # module.staging.module.minio.sakuracloud_disk.disk will be created
  + resource "sakuracloud_disk" "disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "sos21_minio_disk"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = (known after apply)
      + tags              = [
          + "sos21_minio",
          + "sos21_minio_disk",
          + "sos21_staging",
        ]
      + zone              = "is1a"
    }

  # module.staging.module.minio.sakuracloud_server.minio will be created
  + resource "sakuracloud_server" "minio" {
      + commitment        = "standard"
      + core              = 1
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 1
      + name              = "sos21_minio"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "sos21_minio",
          + "sos21_minio_server",
          + "sos21_staging",
        ]
      + zone              = "is1a"

      + network_interface {
          + mac_address      = (known after apply)
          + packet_filter_id = "113300784459"
          + upstream         = "113300784458"
          + user_ip_address  = "192.168.0.12"
        }
    }

  # module.staging.module.nightly.sakuracloud_disk.server_disk must be replaced
-/+ resource "sakuracloud_disk" "server_disk" {
      ~ id                = "113300784620" -> (known after apply)
        name              = "sos21_staging_server_disk"
      ~ server_id         = "113300784623" -> (known after apply)
      ~ source_archive_id = "113300784619" -> (known after apply) # forces replacement
        tags              = [
            "sos21_nightly",
            "sos21_server_disk",
            "sos21_staging",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.staging.module.nightly.sakuracloud_server.server will be updated in-place
  ~ resource "sakuracloud_server" "server" {
      ~ disks            = [
          - "113300784620",
        ] -> (known after apply)
        id               = "113300784623"
        name             = "sos21_staging_server"
        tags             = [
            "sos21_nightly",
            "sos21_server",
            "sos21_staging",
        ]
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.staging.module.beta.module.nixos_archive.sakuracloud_archive.nixos must be replaced
-/+ resource "sakuracloud_archive" "nixos" {
      ~ archive_file = "modules/sakuracloud_archive_nixos_custom/.built_image/0jhqv0kl6qwwjiscpskm4dnywva864b9-sakuracloud-server-image-4c084ab4a7077050c021c9b0613934f9b225eeb28d069ce73f88577d7dfc70f8.img" -> "/home/runner/work/sos21-backend-infrastructure/sos21-backend-infrastructure/modules/sakuracloud_archive_nixos_custom/.built_image/0jhqv0kl6qwwjiscpskm4dnywva864b9-sakuracloud-server-image-4c084ab4a7077050c021c9b0613934f9b225eeb28d069ce73f88577d7dfc70f8.img" # forces replacement
      ~ hash         = "fce96f388d3341c39ef92997633faf93" -> (known after apply) # forces replacement
      ~ id           = "113300784621" -> (known after apply)
        name         = "sos21_staging_nixos"
        tags         = [
            "sos21_archive_nixos",
            "sos21_beta",
            "sos21_staging",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.staging.module.database.module.nixos_database.sakuracloud_archive.nixos will be created
  + resource "sakuracloud_archive" "nixos" {
      + archive_file = "/home/runner/work/sos21-backend-infrastructure/sos21-backend-infrastructure/modules/sakuracloud_archive_nixos_custom/.built_image/clam1n05v55w7wlbyrq012vl6fvrzh7q-sakuracloud-server-image-e2e6cf61b4c728aa3e0a7a311a26b47503eaca13874f569ceeacb44ddb13bc59.img"
      + description  = "clam1n05v55w7wlbyrq012vl6fvrzh7q-sakuracloud-server-image-e2e6cf61b4c728aa3e0a7a311a26b47503eaca13874f569ceeacb44ddb13bc59"
      + hash         = (known after apply)
      + id           = (known after apply)
      + name         = "sos21_database_nixos"
      + size         = 20
      + tags         = [
          + "sos21_archive_nixos_database",
          + "sos21_database",
          + "sos21_staging",
        ]
      + zone         = "is1a"
    }

  # module.staging.module.minio.module.nixos_minio.sakuracloud_archive.nixos will be created
  + resource "sakuracloud_archive" "nixos" {
      + archive_file = "/home/runner/work/sos21-backend-infrastructure/sos21-backend-infrastructure/modules/sakuracloud_archive_nixos_custom/.built_image/h3z15inn3dwnj6s972h0fmk43q667yc6-sakuracloud-server-image-f1470ccc052a2954d26d877dcf7cfa62682f91b80958dd3a91d9c9bfcf6ec854.img"
      + description  = "h3z15inn3dwnj6s972h0fmk43q667yc6-sakuracloud-server-image-f1470ccc052a2954d26d877dcf7cfa62682f91b80958dd3a91d9c9bfcf6ec854"
      + hash         = (known after apply)
      + id           = (known after apply)
      + name         = "sos21_minio_nixos"
      + size         = 20
      + tags         = [
          + "sos21_archive_nixos_minio",
          + "sos21_minio",
          + "sos21_staging",
        ]
      + zone         = "is1a"
    }

  # module.staging.module.nightly.module.nixos_archive.sakuracloud_archive.nixos must be replaced
-/+ resource "sakuracloud_archive" "nixos" {
      ~ archive_file = "modules/sakuracloud_archive_nixos_custom/.built_image/7q9m1ww61r87gbdgzzv0aqqwc7l1b3i9-sakuracloud-server-image-4c084ab4a7077050c021c9b0613934f9b225eeb28d069ce73f88577d7dfc70f8.img" -> "/home/runner/work/sos21-backend-infrastructure/sos21-backend-infrastructure/modules/sakuracloud_archive_nixos_custom/.built_image/7q9m1ww61r87gbdgzzv0aqqwc7l1b3i9-sakuracloud-server-image-4c084ab4a7077050c021c9b0613934f9b225eeb28d069ce73f88577d7dfc70f8.img" # forces replacement
      ~ hash         = "f75134a7d7ffdab445566607d0ce0a9b" -> (known after apply) # forces replacement
      ~ id           = "113300784619" -> (known after apply)
        name         = "sos21_staging_nixos"
        tags         = [
            "sos21_archive_nixos",
            "sos21_nightly",
            "sos21_staging",
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 10 to add, 2 to change, 4 to destroy.
```
</details>